---
kind: other
id: Properties.T:Autodesk.Revit.DB.CADLinkType
source: html/45369331-da9d-8174-6374-97b7aed60281.htm
---
# CADLinkType Properties

The id of the assembly instance to which the element belongs.